[
  {
    "projectName": "Everaise Academy",
    "techStack": [
      ["Co-founder"],
      ["Program Coordinator"]
    ],
    "description": 
      "I co-founded a 501(c)(3) non-profit online STEM school that offers courses in Math, Physics, Biology, and Astronomy. As program coordinator, I conducted outreach campaigns to recruit over 50 qualified high school and college students, reaching over 1,500 students from 40+ countries. Furthermore, I headed book publishing and delivery; managed finances; directed web design; organized partnerships and acquired $15k in sponsorships; and coordinated school-wide events such as competitions and guest lectures from professors and industry leaders."
    ,
    "imgSrc": "../images/everaise.png",
    "projectLink": "https://everaise.org/",
    "projectID": "everaise"
  },
  {
    "projectName": "Toga Junior Math Club",
    "techStack": [
      ["Liaison"],
      ["Head Coach"],
      ["MATHCOUNTS Chapter Lead Coordinator"]
    ],
    "description": 
      "As a Head Coach for Redwood Middle School’s Math Club, I created a comprehensive 3-year rotating curriculum covering advanced topics in Algebra, Geometry, Combinatorics, and Number Theory. As Liaison, I organized club events and contest participation and facilitated communication between administrators, volunteers, parents and students. I was also a founding member for our local MATHCOUNTS Chapter (South Santa Clara Valley) and served as the lead coordinator for testing logistics, proctoring, and grading for 12 local middle schools."
    ,
    "imgSrc": "../images/tjmc_infinity.png",
    "projectLink": "https://togamath.com/",
    "projectID": "tjmc"
  },
  {
    "projectName": "Boys Team Charity, Saratoga Chapter",
    "techStack": [
      ["President"]
    ],
    "description": 
      "As president of a volunteer chapter with 150+ members, I organized guest speaker and charity events. As a volunteer, I served as a STEM project designer and lead at the Sunday Friends low-income community center by engaging K-6 students in math through origami and setting up a computer system with a database of math problems."
    ,
    "imgSrc": "../images/boys-team-charity.png",
    "projectLink": "https://www.boysteamcharity.org",
    "projectID": "btc"
  }
]